---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WalkthroughFramesCount
source: html/23ec124c-29ea-a25b-6417-4e865e6ca24b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WalkthroughFramesCount Property

"Walkthrough Frames"

## Syntax (C#)
```csharp
public static ForgeTypeId WalkthroughFramesCount { get; }
```